Repository: DrupalOpenGardenProject/Site-Structure
Catalog: sites/all/modules/contrib/views_charts/translations/*.po
Languages: pt_br

source: Charts
pt_br: Gráficos

source: Displays rows in a chart.
pt_br: Apresentar linhas em um gráfico.

source: -- None --
pt_br: -- Nenhum --

source: Fields to be used in Chart Series
pt_br: Campos a serem usados como séries de dados

source: These fields will be used as data fields for chart series. Fields must contain numeric data!
pt_br: Esse campos serão usados como séreis de dados. Eles devem conter informação numérica!

source: Fields to be used as X axis labels
pt_br: Campos a serem usados como identificadores no eixo X

source: Canvas width in pixels
pt_br: Largura da área de desenho do gráfico em pixels

source: Canvas height in pixels
pt_br: Altura da área de desenho do gráfico em pixels

source: Charting Engine
pt_br: Biblioteca de desenho de gráficos

source: Chart Type
pt_br: Tipo de gráfico

source: Window Mode (for flash charts only)
pt_br: Mode de apresentação (para bibliotecas Flash de desenho de gráfico)

source: Min value of Y Axis
pt_br: Valor mínimo do eixo Y

source: Y Legend
pt_br: Texto para o eixo Y

source: Preview not available for Charts display style. Please view on a full page
pt_br: O estilo Charts não apresenta preview. Salve a visualização e veja o resultado através da URL definida.

source: Views Charts provides a new style for views: Charts.
pt_br: Views Charts implementa um novo estilo para as visualizações: gráficos.
