Repository: DrupalOpenGardenProject/Site-Structure
Catalog: sites/all/modules/contrib/logintoboggan/translations/*.po
Languages: it

source: <p>The Login Toboggan module improves the Drupal login system by offering the following features: <ol> <li>Allow users to login using either their username OR their e-mail address.</li> <li>Allow users to define their own password during registration.</li> <li>Allow users to login immediately.</li> <li>Provide a login form on Access Denied pages for non-logged-in (anonymous) users.</li> <li>The module provides two login block options: One uses JavaScript to display the form within the block immediately upon clicking 'log in'. The other brings the user to a separate page, but returns the user to their original page upon login.</li> <li>Customize the registration form with two e-mail fields to ensure accuracy.</li> <li>Optionally redirect the user to a specific page when using the 'Immediate login' feature.</li> <li>Optionally redirect the user to a specific page upon validation of their e-mail address.</li> <li>Optionally display a user message indicating a successful login.</li> </ol> These features may be turned on or off in the Login Toboggan <a href="!url">settings</a>.</p> <p>Because this module completely reorients the Drupal login process you will probably want to edit the welcome e-mail on the user settings page. For instance if you have enabled the 'Set password & Immediate Login' option, you probably should not send the user's password out in the welcome e-mail (also note when the 'Set password & Immediate Login' option is enabled, the !login_url becomes a verification url that the user MUST visit in order to enable authenticated status). The following is an example welcome e-mail:</p>
it: <p>Il modulo Login Toboggan migliora il sistema di login di Drupal offrendo le seguenti funzionalità: <ol> <li>Permette agli utenti di effettuare il login usando o lo username o l'indirizzo email.</li> <li>Permette agli utenti di definire la propria password in fase di registrazione.</li> <li>Permette agli utenti di effettuare il login immediatamente.</li> <li>Fornisce un modulo di login sulle pagine Accesso Negato per gli utenti non autenticati (anonimi).</li> <li>Il modulo fornisce du opzioni per il blocco del login: Uno usa JavaScript per visualizzare il modulo nel blocco immediatamente dopo aver cliccato 'log in'. L'altro porta l'utente su una pagina separata, ma ritorna l'utente alla pagina originaria dopo aver effettuato il login.</li> <li>Personalizza il modulo di registrazione con due campi email per assicurare accuratezza.</li> <li>Opzionalmente redireziona l'utente ad una pagina specifica quando si usa la funzionalità 'Login immediato'.</li> <li>Opzionalmente redireziona l'utente ad una specifica pagina dopo la validazione del proprio indirizzo email.</li> <li>Opzionalmente visualizza all'utente un messaggio di 'login con successo'.</li> </ol> Queste funzionalità possono essere attivate o disattivate nelle <a href="!url">impostazioni</a> di Login Tobbogan <p>Poichè questo modulo modifica completamente il processo di login di Drupal, probabilmente sono da modificare le email di benvenuto nella pagina di impostazione utenti. Per esempio, se hai abilitato l'opzione 'Imposta password & login immediato', probabilmente potresti non inviare la password all'utente nella email di benvenuto (nota inoltre che quando l'opzione 'Imposta password & login immediato' è abilitata, la !login_url diventa un indirizzo di verifica che l'utente DEVE visitarte per abilitare lo stato di autenticato) Di seguito c'è un esempio di email di benvenuto:</p>

source: <p>Note that if you have set the 'Visitors can create accounts but administrator approval is required' option for account approval, and are also using the 'Set password & Immediate Login' feature of LoginToboggan, the user will immediately receive the permissions of the pre-authorized user role -- you may wish to create a pre-authorized role with the exact same permissions as the anonymous user if you wish the newly created user to only have anonymous permissions.</p><p>In order for a site administrator to unblock a user who is awaiting administrator approval, they must either click on the validation link they receive in their notification e-mail, or manually remove the user from the site's pre-authorized role -- afterwards the user will then receive 'authenticated user' permissions. In either case, the user will receive an account activated e-mail if it's enabled on the user settings page -- it's recommended that you edit the default text of the activation e-mail to match LoginToboggan's workflow as described. </p><p>If you are using the 'Visitors can create accounts and no administrator approval is required' option, removal of the pre-authorized role will happen automatically when the user validates their account via e-mail.</p><p>Also be aware that LoginToboggan only affects registrations initiated by users--any user account created by an administrator will not use any LoginToboggan functionality.
it: <p>Nota che se imposti l'opzione per l'approvazione degli account 'I visitatori possono creare account ma la approvazione amministrativa è obbligatoria', e si sta usando anche la funzionalità 'Imposta password e login immediato' di LoginTobbogan, l'utente riceverà immediatamente i permessi del ruolo pre-autorizzato -- sarebbe preferibile creare un ruolo pre-autorizzato con gli stessi permessi di un utente anonimo se preferisci che i nuovi iscritti abbiano solo permessi di un utente anonimo.</p><p>Per permettere ad un amministratore del sito di sbloccare un utente in attesa di approvazione amministrativa, egli deve cliccare sul link di validazione che riceve nella sua email di notifica, oppure rimuovere manualmente il ruolo pre-autorizzato dall'account utente -- dopo di ciò l'utente riceverà i permessi di 'utente autenticato'. In entrambi i casi, l'utente riceverà una email di attivazione account se abilitato nella pagina di impostazioni utenti -- è raccomandata la modifica del testo predefinito della email di attivazione per corrispondere al workflow di LoginTobbogan descritto. </p><p>Se stai usando l'opzione 'I visitatori possono creare account e nessuna approvazione amministrativa è richiesta', la rimozione del ruolo pre-autorizzato sarà automatica una volta che l'utente valida il suo account via email.</p><p>Sappi inoltre che LoginTobbogan impatta solo sulle registrazioni iniziate dagli utenti -- qualsiasi account creato da un amministraotre non userà alcuna funzionalità di Logintobbogan</p>

source: <p>Customize your login and registration system. More help can be found <a href="!url">here</a>.</p>
it: <p>Personalizza il tuo sistema di login e registrazione. Maggiore aiuto può essere trovato <a href='!url'>qui</a></p>

source: !username, Thank you for registering at !site. IMPORTANT: For full site access, you will need to click on this link or copy and paste it in your browser: !login_url This will verify your account and log you into the site. In the future you will be able to log in using the username and password that you created during registration. -- !site team
it: !username, Grazie per esserti registrato su !site. IMPORTANTE: Per avere accesso completo al sito, devi cliccare su questo link oppure copiarlo e incollarlo nel tuo browser: !login_url Questo verificherà il tuo account e ti farà accedere al sito. In futuro potrai effettuare il login usando la username e la password che son stati creati durante la fase di registrazione. -- !site team

source: <strong>Note:</strong> Logintoboggan module is installed. If you are using one of the custom login block types below, it is recommended that you set this to <em>&lt;none&gt;</em>.
it: <strong>Nota:</strong> Il modulo Logintoboggan è installato. Se stai usando uno dei blocchi di login personalizzati sotto, è raccomandato che imposti questo a <em>&lt;none&gt;</em>.

source: Block type
it: Tipo di blocco

source: Collapsible form
it: Form collassabile

source: 'Standard' is a standard login block, 'Link' is a login link that returns the user to the original page after logging in, 'Collapsible form' is a javascript collaspible login form.
it: 'Standard' è un blocco standard per il login, 'Link' è un link al login che ritorna l'utente alla pagina originaria dopo il login, 'Form collassabile' è un form collassabile con javascript.

source: Set a custom message to appear at the top of the login block
it: Imposta un messaggio personalizzato da far apparire in testa al blocco di login

source: If this user was created using the "Immediate Login" feature of LoginToboggan, and they are also awaiting adminstrator approval on their account, you must remove them from the site's pre-authorized role in the "Roles" section below, or they will not receive authenticated user permissions!
it: Se questo utente è stato creato usando la funzionalità "Login immediato" di LoginTobbogan, ed inoltre attendono l'approvazione amministrativa per il proprio account, devi rimuoverlo dal ruolo pre-autorizzato nella sezione "Ruoli" sotto, altrimenti non riceveranno i permessi di utente autenticato!

source: The user is assigned LoginToboggan's pre-authorized role, and is not currently receiving authenticated user permissions.
it: L'utente è assegnato al ruolo pre-autorizzato di LoginTobbogan e non sta correntemente ricevendo i permessi di utente autenticato.

source: Confirm e-mail address
it: Conferma indirizzo email

source: Please re-type your e-mail address to confirm it is accurate.
it: Per favore, re-immetti il tuo indirizzo email per conferma.

source: between !min and
it: tra !min e

source: no more than
it: non più di

source: Please choose a password for your account; it must be !length 30 characters and spaces are not allowed.
it: Per favore scegli una password per il tuo account; deve essere !length 30 caratteri e gli spazi non sono permessi.

source: edit
it: modifica

source: A validation e-mail has been sent to your e-mail address. In order to gain full access to the site, you will need to follow the instructions in that message.
it: Una email di validazione è stata spedita al tuo indirizzo email. Per ottenere l'accesso completo al sito, devi seguire le istruzioni in tale email.

source: Your password and further instructions have been sent to your e-mail address.
it: La tua password e ulteriori informazioni sono state spedite al tuo indirizzo email.

source: Thank you for applying for an account. Your account is currently pending approval by the site administrator.<br />
it: Grazie per aver richiesto la registrazione. Il tuo account è attualmente in attesa di approvazione dall'amministratore del sito.<br />

source: Your e-mail address and confirmed e-mail address must match.
it: Il tuo indirizzo email e la conferma di email devono coincidere.

source: LoginToboggan logged in block
it: LogiTobbogan logged in blocco

source: Disabled
it: Disabilitato

source: Enabled
it: Abilitato

source: Allow users to login using their e-mail address
it: Permetti agli utenti di effettuare il login con il loro indirizzo email

source: Users will be able to enter EITHER their username OR their e-mail address to log in.
it: Gli utenti possono inserire sia lo username che l'indirizzo email per effettuare il login.

source: Registration
it: Registrazione

source: Use two e-mail fields on registration form
it: Usa due campi email nel modulo di registrazione

source: User will have to type the same e-mail address into both fields. This helps to confirm that they've typed the correct address.
it: Gli utenti dovranno inserire lo stesso indirizzo email in entrambi i campi. Questo aiuta a confermare che ciò che hanno scritto è l'indirizzo esatto.

source: Set password
it: Imposta password

source: This will allow users to choose their initial password when registering. If selected, users will be assigned to the role below and logged in immediately. They will not be assigned to the 'authenticated user' role until they confirm their e-mail address by following the link in their registration e-mail. It is HIGHLY recommended that you set up a 'pre-authorized' role with limited permissions for this purpose. <br />NOTE: If you enable this feature, you should edit the <a href="!settings">Welcome, no approval required</a> text -- more help in writing the e-mail message can be found at <a href="!help">LoginToboggan help</a>.
it: Questo permette agli utenti di impostare la password in fase di registrazione. Se selezionata, agli utenti sarà assegnato il ruolo sotto e saranno autenticati immediatamente. Non gli verrà assegnato il ruolo "utente autenticato" fintanto che non confermano il loro indirizzo email cliccando il link nella email di registrazione. È ALTAMENTE raccomandato che imposti un ruolo 'pre-autenticato' con permessi limitati per questo motivo. <br />NOTE: Se abiliti questa impostazione, dovresti modificare il testo <a href="!settings">Benvenuto, nessuna approvazione richiesta</a> -- maggiore aiuto nello scrivere questa email lo puoi trovare nel <a href="!help">LoginToboggan help</a>.

source: Non-authenticated role
it: Ruolo non autenticato

source: If "Set password" is selected, users will be able to login before their e-mail address has been authenticated. Therefore, you must choose a role for new non-authenticated users. Users will be removed from this role and assigned to the "authenticated user" role once they follow the link in their welcome e-mail. <a href="!url">Add new roles</a>.
it: Se "Imposta password" è selezionata, gli utenti possono effettuare il login prima che il loro indirizzo email sia autenticato. A causa di ciò devi scegliere un ruolo per i nuovi utenti non autenticati. Gli utenti saranno rimossi da tale ruolo ed assegnati al ruolo "utente autenticato" dopo aver cliccato il link nella loro email di benvenuto. <a href="!url">Aggiungi nuovi ruoli</a>.

source: Never delete
it: Non cancellare mai

source: 1 Day
it: 1 Giorno

source: 2 Days
it: 2 Giorni

source: 3 Days
it: 3 Giorni

source: 4 Days
it: 4 Giorni

source: 5 Days
it: 5 Giorni

source: 6 Days
it: 6 Giorni

source: 1 Week
it: 1 Settimana

source: 2 Weeks
it: 2 Settimane

source: 1 Month
it: 1 Mese

source: 3 Months
it: 3 Mesi

source: 6 Months
it: 6 Mesi

source: 1 Year
it: 1 Anno

source: Delete unvalidated users after
it: Cancella utenti non validati dopo

source: If enabled, users that are still in the 'Non-authenticated role' set above will be deleted automatically from the system, if the set time interval since their last login has passed. This can be used to automatically purge spambot registrations. Note: this requires cron, and also requires that the 'Set password' option above is enabled.
it: Se abilitato, gli utenti che sono ancora nel 'ruolo non autenticato' impostato sopra saranno cancellati automaticamente dal sistema, se l'intervallo di tempo impostato è passato dal loro ultimo login. Può essere usato per eliminare automaticamente le registrazioni dei motori spam. Nota: questa impostazione richiede cron, ed inoltre richiede che l'opzione "Imposta password" sia abilitata.

source: Immediate login
it: Login immediato

source: If set, the user will be logged in immediately after registering. Note this only applies if the 'Set password' option above is enabled.
it: Se impostata, l'utente sarà loggato immediatamente dopo la registrazione. Nota che questa opzione funziona solo se l'opzione 'Imposta password' è abilitata.

source: Redirections
it: Redirezioni

source: Redirect path on registration
it: Percorso di redirezione per la registrazione

source: Normally, after a user registers a new account, they will be taken to the front page, or to their user page if you specify <cite>Immediate login</cite> above. Leave this setting blank if you wish to keep the default behavior. If you wish the user to go to a page of your choosing, then enter the path for it here. For instance, you may redirect them to a static page such as <cite>node/35</cite>, or to the <cite>&lt;front&gt;</cite> page. You may also use <em>%uid</em> as a variable, and the user's user ID will be substituted in the path.
it: Normalmente, dopo che un utente registra un nuovo account, viene portato alla pagina principale, oppure alla propria pagina utente se è selezionato <cite>Login immediato</cite> sopra. Lascia questa impostazione vuota se preferisci mantenere il comportamento di default. Se preferisci che l'utente va ad una pagina particolare da te scelta, inserisci il percorso della pagina qui. Per esempio, potresti redirezionarli ad una pagina statica come ad esempio <em>node/35</em>, oppure alla <cite>&lt;front&gt;</cite> page. Puoi usare <em>%uid</em> come variabile, e l'identificativo dell'utente sarà sostituito al percorso.

source: Redirect path on confirmation
it: Percorso di redirezione per la conferma

source: Normally, after a user confirms their new account, they will be taken to their user page. Leave this setting blank if you wish to keep the default behavior. If you wish the user to go to a page of your choosing, then enter the path for it here. For instance, you may redirect them to a static page such as <cite>node/35</cite>, or to the <cite>&lt;front&gt;</cite> page. You may also use <em>%uid</em> as a variable, and the user's user ID will be substituted in the path.
it: Normalmente, dopo che un utente conferma il proprio account, viene portato sulla pagina del proprio account. Lascia questa impostazione vuota se preferisci mantenere il comportamento di default. Se preferisci che l'utente va ad una pagina particolare da te scelta, inserisci il percorso della pagina qui. Per esempio, potresti redirezionarli ad una pagina statica come ad esempio <em>node/35</em>, oppure alla <cite>&lt;front&gt;</cite> page. Puoi usare <em>%uid</em> come variabile, e l'identificativo dell'utente sarà sostituito al percorso.

source: Other
it: Altro

source: Present login form on access denied (403)
it: Visualizza modulo login in caso di accesso negato (403)

source: Anonymous users will be presented with a login form along with an access denied message.
it: Agli utenti anonimi sarà presentato il modulo di login oltre al messaggio di accesso negato.

source: Display login successful message
it: Visualizza messaggio di login con successo

source: If enabled, users will receive a 'Login successful' message upon login.
it: Se abilitato, gli utenti riceveranno un messaggio di 'Login con successo' dopo aver effettuato il login.

source: None
it: Nessuno

source: Minimum password length
it: Lunghezza minima password

source: LoginToboggan automatically performs basic password validation for illegal characters. If you would additionally like to have a mimimum password length requirement, select the length here, or set to 'None' for no password length validation.
it: LoginTobbogan implementa automaticamente dei controlli sulla validità della password contro caratteri illegali. Se vuoi impostare anche una lunghezza minima della password, seleziona la lunghezza qui, oppure imposta a "Nessuno" per nessun tipo di validazione sulla lunghezza.

source: Access Denied / User Login
it: Accesso Negato / Login Utente

source: Access denied. You may need to login below or register to access this page.
it: Accesso negato. Puoi effettuare il login con il modulo in basso o registrarti per accedere a questa pagina.

source: Access Denied
it: Accesso Negato

source: You must enter a password.
it: Devi inserire una password.

source: The password cannot contain spaces.
it: La password non può contenere spazi

source: The password contains an illegal character.
it: La password contiene un carattere non permesso

source: The password is too long: it must be less than 30 characters.
it: La password è troppo lunga: deve essere al massimo 30 caratteri.

source: The password is too short: it must be at least %min_length characters.
it: La password è troppo corta: deve essere almeno %min_length caratteri.

source: You have successfully validated your e-mail address.
it: Hai validato correttamente il tuo indirizzo email.

source: Your account is currently blocked -- login cancelled.
it: Il tuo account è attualmente bloccato -- login cancellato.

source: You have successfully validated %user.
it: Hai validato correttamente %user.

source: Sorry, you can only use your validation link once for security reasons. Please !login with your username and password instead now.
it: Spiacenti, puoi utilizzare il tuo link di validazione solo una volta per motivi di sicurezza. Per favore, !login con le tue credenziali adesso.

source: You have just used your one-time login link. It is no longer necessary to use this link to login. Please change your password.
it: Hai appena usato il tuo link di accesso one-time. Non è più necessario usare tale link per effettuare il login. Per favore, cambia la tua password.

source: Account validation
it: Validazione account

source: re-send validation e-mail
it: re-invia email di validazione

source: Login successful.
it: Login effettuato con successo.

source: This name has already been taken by another user.
it: Questo username è già stato usato da un altro utente.

source: This e-mail has already been taken by another user.
it: Questo indirizzo di posta elettronica è già stato usato da un altro utente.

source: If required, you may reset your password from: !url
it: Se richiesto, puoi reimpostare la password da: !url

source: A validation e-mail has been sent to the user's e-mail address.
it: Una email di validazione è stata inviata all'indirizzo di posta elettronica dell'utente.

source: A validation e-mail has been sent to your e-mail address. You will need to follow the instructions in that message in order to gain full access to the site.
it: Una email di validazione è stata inviata al tuo indirizzo di posta elettronica. Per ottenere l'accesso completo al sito, è necessario seguire le istruzioni che troverai nella email ricevuta.

source: (!site) Account application for !username
it: (!site) Richiesta di account per !username

source: !username has applied for an account, and has automatically received the permissions of the LoginToboggan validating role. To give the user full site permissions, click the link below: !validating_url Alternatively, you may visit their user account listed below and remove them from the validating role. !edit_uri
it: !username ha richiesto di registrarsi, ed ha automaticamente ricevuto i permessi del ruolo validante LoginToboggan. Per assegnargli i permessi completi, clicca il sottostante link: !validating_url Alternativamente, puoi visitare il suo account e rimuoverlo dal ruolo di validazione. !edit_uri

source: !username has applied for an account. !edit_uri
it: !username ha richiesto un account. !edit_url

source: Username or e-mail address
it: Username o indirizzo email

source: Username or e-mail
it: Username o email

source: You may login with either your assigned username or your e-mail address.
it: Puoi effettuare il login sia con lo username assegnato che con il tuo indirizzo di posta elettronica.

source: The password field is case sensitive.
it: Il campo password è case sensitive.

source: You are not authorized to access this page.
it: Non sei autorizzato a visualizzare questa pagina

source: Login/Register
it: Accedi/Registrati

source: Purged the following unvalidated users: !purged_users
it: Eliminati i seguenti utenti non validati: !purged_users

source: security
it: sicurezza

source: Detected malicious attempt to alter protected user fields.
it: rilevati tentativi malevoli di alterare i campi protetti utente.

source: user
it: utente

source: New user: %name (%email).
it: Nuovo utente: %name (%email).

source: E-mail validation URL used for %name with timestamp @timestamp.
it: URL di validazione email usata per %name nel momento %timestamp.

source: Session opened for %name.
it: Sessione aperta per %name.
