Repository: DrupalOpenGardenProject/Site-Structure
Catalog: sites/all/modules/contrib/logintoboggan/translations/*.po
Languages: it

source: User %name used one-time login link at time %timestamp.
it: L'utente %name ha usato il link one-time nel momento %timestamp.

source: LoginToboggan
it: LoginTobbogan

source: Set up custom login options like instant login, login redirects, pre-authorized validation roles, etc.
it: Imposta le opzioni specifiche per il login, ad esempio login istantaneo, redirezione al login, ruoli di validazione pre-autenticazione, etc.

source: Validate e-mail address
it: Valida indirizzo di posta elettronica

source: Access denied
it: Accesso negato

source: Re-send validation e-mail
it: Reinvia email di validazione

source: logintoboggan cleaning of user data successful
it: Pulizia dei dati utente completata con successo

source: Your previous setting for the logintoboggan pre-auth role was the anonymous user role, which is no longer allowed. The pre-auth role has now been set to the authenticated user role for your site. <em>Because of this change, all unvalidated users on your site now have authenticated user permissions!</em> If you wish to retain the previous functionality, create a new user role with the same access permissions as the anonymous user, and set the logintoboggan pre-auth role to the newly created role. You will also need to manually add any previously unvalidated users to the newly created pre-auth role.
it: L'impostazione precedente per il ruolo pre-autorizzazione di logintobbogan era il ruolo "utente anonimo", che non è più permesso. <em>A causa di questo cambiamento, tutti gli utenti non validati del tuo sito adesso hanno i permessi di "utente autenticato" !</em>Se vuoi mantenere la funzionalità precedente, crea un nuovo ruolo con gli stessi permessi di accesso dell'utente anonimo, e imposta il ruolo pre-autenticazione di logintobbogan su questo ruolo appena creato. È necessaria inoltre l'aggiunta manuale per ogni utente precedentemente non validato del nuovo ruolo.

source: logintoboggan cleaning of user/profile data successful
it: Pulizia dei dati utente/profilo completata con successo

source: Improves Drupal's login system.
it: Migliora il sistema di login di Drupal.
